<doku:title parent="073" tags="adventure,php,framework,apf,news" title="News" urlname="News">
   Auf dieser Seite lesen Sie eine Zusammenfassung der historisierten News des Adventure PHP
   Framework (APF).
</doku:title>
<p>
   Auf dieser Seite lesen Sie eine Zusammenfassung der historisierten News des Adventure PHP
   Framework (APF).
</p>

<div class="newsitem">
   <img src="http://media.adventure-php-framework.org/img/illustrations/red_hat_logo.png" alt="RPM-Installations-Pakete f&uuml;r das APF von Reiner Rottmann" />
   <h3><int:link pageid="110" /></h3>
   <div class="date">Sonntag, 26. September 2009</div>
   <p>
      Ab heute stehen RPM-Pakete zur Installation und Verteilung des APF auf RedHat-basierten
      LINUX-Distributionen zur Verf&uuml;gung. Reiner Rottmann hat dazu einen dedizierten YUM-Channel
      bereit gestellt, der Code- sowie Demo-Pakete beinhaltet.
   </p>
   <p>
      Das <int:link pageid="110" /> beschreibt, wie die Pakete mit Hilfe des <em>Yellowdog Update
      Managers</em> (YUM) verwaltet werden k&ouml;nnen.
   </p>
   <p class="legal">
      Rechtlicher Hinweis: das abgebildete Logo ist Eigentum von
      <a href="http://www.redhat.com/" title="RedHat">RedHat</a> und unterliegt den auf der
      Hersteller-Seite beschriebenen rechtlichen Bestimmungen.
   </p>
</div>

<div class="newsitem">
  <img src="http://media.adventure-php-framework.org/content/apf-vs-yii.png" alt="Performance-Check: Yii vs. APF (and CakePHP)" />
  <h3><int:link pageid="103">Performance-Check: Yii vs. APF (und CakePHP)</int:link></h3>
  <div class="date">Sonntag, 01. M&auml;rz 2009</div>
  <p>
     Der Artikel Yii vs. APF empfindet den RPS-Performance-Test aus
     <a class="external" href="http://www.yiiframework.com/performance">http://www.yiiframework.com/performance</a>
     nach und vergleicht die Test-Kandidaten CakePHP, Yii-Framework und Adventure PHP Framework.
     Ergebnis: <strong>der Yii-Test ist bestanden!</strong>
     (<int:link pageid="103">mehr lesen&hellip;</int:link>)
   </p>
</div>

<div class="newsitem">
   <img src="http://media.adventure-php-framework.org/content/why_apf_teaser.png" alt="Why APF?" />
   <h3><int:link pageid="088" /></h3>
   <p>
      Sie denken: &quot;Das APF ist nur ein weiteres Framework&quot;? Auf der Seite
      <int:link pageid="088" /> finden Sie Gr&uuml;nde, warum Sie das Adventure PHP Framework (APF)
      unbedingt einsetzen und sollten!
   </p>
   <p>
      <strong>Kurz zusammengefasst:</strong> Das APF unterst&uuml;tzt Sie, enterprise-ready
      Web-Applikationen und -Module zu entwickeln, die schnell, sicher und wiederverwendbar sind. 
      Das Framework bietet dabei sowohl erprobte Tools zur Entwicklung nach anerkannten Design-Pattern
      als auch fertige Module, die bekannte Aufgabenstellungen allgemeing&uuml;ltig l&ouml;sen.
   </p>
</div>

<div class="newsitem">
   <h3>Neues Einsteiger-Tutorial "Minimales Modul"</h3>
   <p>
      Wie im Forum gew&uuml;nscht wurde ein neues, forenbasiertes Einsteiger-Tutorial verfasst, das
      zeigt, wie ein einfaches Modul f&uuml;r das Adventure PHP Framework erstellt werden kann. Es
      beschreibt Schritt f&uuml;r Schritt wie aus einem leeren Template ein Taschenrechner
      entsteht. Das Tutorial kann unter
      <a class="forum" href="http://forum.adventure-php-framework.org/de/viewtopic.php?f=6&t=44" linkrewrite="false" title="Minimales Modul">http://forum.adventure-php-fra...ic.php?f=6&t=44</a>
      aufgerufen werden.
   </p>
</div>

<div class="newsitem">
   <h3>Erste Schritte mit dem Adventure PHP Framework!</h3>
   <p>
      Das Tutorial <int:link pageid="048" /> in der Rubrik <int:link pageid="071" /> zeigt, wie der
      Entwickler auf sehr einfache Seite eine Webseite mit dem Framework erstellen kann. Es wird
      zus&auml;tzlich ein Ausblick auf komplexere Webseiten und die M&ouml;glichkeit dynamischen
      Inhalt anzuzeigen gegeben. Wichtige Informationen sind auch im Forums-Thread
      <doku:link>http://forum.adventure-php-framework.org/de/viewtopic.php?f=6&t=17</doku:link>
      enthalten.
   </p>
</div>

<div class="newsitem">
   <h3>Hacking & das Adventure PHP Framework?</h3>
   <p>
      Im Artikel <a href="./?Seite=060-HaCkinG-und-das-APF" title="Hacking & das Adventure PHP Framework">Hacking & das Adventure PHP Framework</a>
      unter der Rubrik <strong>Literatur</strong> zieht Christian Achatz ein Res&uuml;mee aus dem Betrieb der
      letzten 3 Monate und zeigt auf, welche Sicherheitsfeatures das Framework f&uuml;r den Betrieb
      einer Webseite oder einer Webapplikation bereits out-of-the-box mitbringt. Gerade in einer Zeit, in
      der Exploits tausendfach verf&uuml;gbar sind, gilt es ein wirksames Mittel bereit zu halten, das
      <em>Script-Kiddies</em> keine Chance gibt.
   </p>
</div>

<div class="newsitem">
   <h3>AJAX und das Adventure PHP Framework!</h3>
   <p>
      Der Artikel
      <a href="./?Page=061-AJAX-and-the-APF" title="AJAX & the APF">AJAX & the adventure php framework</a>
      (englisch) zeigt, wie AJAX-Anwendungen in die Software-Architekturen bestehender Module
      eingef&uuml;gt werden k&ouml;nnen, wie das Adventure PHP Framework dabei hilft und welche Probleme
      bei der Implementierung auftreten k&ouml;nnen. Ein Review mit hilfreichen Hinweisen und offenen
      Fragestellungen schlie&szlig;en den Artikel und laden zur Kommentierung ein.
   </p>
</div>

<div class="newsitem">
   <h3>Adventure PHP Framework Anwenderprojekte!</h3>
   <p>
      Auf der Seite <a href="./?Seite=041-Referenzen" title="Referenzen">Referenzen</a> sind Projekte von
      Anwendern aufgef&uuml;hrt. <strong>Ich w&uuml;rde mich freuen, wenn auch Sie Ihr Projekt melden
      und einen kurzen Erfahrungsbericht abgeben. Nur so kann die Qualit&auml;t der Dokumentation und
      des Frameworks selbst verbessert und vereinfacht werden.</strong>
   </p>
</div>

<div class="newsitem">
   <h3>Was leistet das Adventure PHP Framework?</h3>
   <div class="date">25.10.2007</div>
   <p>
      Ab heute steht der Artikel <a href="./?Seite=049-PHP-Frameworks-im-Test" title="PHP Frameworks im Test">PHP Frameworks im Test</a>
      zur Verf&uuml;gung. Dieser vergleicht die am Markt verf&uuml;gbaren Parallelprodukte und gibt dem
      Leser eine &Uuml;bersicht der Leistungsmerkmalen im Hinblick auf die Entscheidung f&uuml;r ein
      Produkt als langfristige Entwicklungsbasis. Der Artikel kann jedoch nicht nur als Vergleichswerk
      sondern vielmehr auch als Ressource f&uuml;r die Verwendung einzelner Testkandidaten herangezogen
      werden.
   </p>
</div>