<doku:title parent="071" tags="apf,installation,download,erste schritte,anleitung,einstieg,download" title="Download, Installation und erste Schritte" urlname="Download-Installation-und-erste-Schritte">
   Das Tutorial beschreibt Schritt f&uuml;r Schritt die Einrichtung des Adventure PHP Framework vom Download bis zur
    &quot;Hallo Welt&quot; Applikation.
</doku:title>
<img src="http://media.adventure-php-framework.org/content/first-steps.png" alt="Download, Installation und erste Schritte" class="leftTeaser"/>
<h3 id="Chapter-1-Einleitung"><a href="#Chapter-1-Einleitung">1. Einleitung</a></h3>
In diesem Tutorial wird Schritt f&uuml;r Schritt erkl&auml;rt, wie man das Adventure PHP Framework
(kurz APF) einrichtet.

<h3 id="Chapter-2-Anforderungen"><a href="#Chapter-2-Anforderungen">2. Anforderungen</a></h3>
Es wird davon ausgegangen, dass ein PHP f&auml;higer Server zur Verf&uuml;gung steht. F&uuml;r einen
lokalen Testserver unter Windows eignet sich
<a class="external" href="http://www.apachefriends.org/de/xampp.html" title="XAMPP f&uuml;r Windows">XAMPP</a> sehr
gut. Es beinhaltet eine Installation aller wichtigen Serverkomponenten, wie Apache, PHP, MySQL, etc.
Je nachdem wie euer System aufgebaut ist, m&uuml;ssen die Pfade angepasst werden. Auf LINUX/UNIX
k&ouml;nnt ihr die PHP Bibliotheken mit dem favorisierten Paket-Manager direkt installieren.

<h3 id="Chapter-3-Download"><a href="#Chapter-3-Download">3. Download</a></h3>
Unter <a href="http://adventure-php-framework.org/Seite/008-Downloads" title="APF Downloads">Downloads</a>
findet man stets die aktuellste Version des APF. Zum Zeitpunkt der Erstellung des Tutorials ist
dies die Version 1.10.
<br />
<br />
Bei den Release-Dateien wird zwischen folgenden Paket-Typen unterschieden:
<ul>
   <li>
      Beispiel-Projekt: (apf-demopack-*):
      <br />
      Enth&auml;lt die notwendigen APF Dateien, sowie einige Anwendungsbeispiele. Dieses Paket ist
      speziell f&uuml;r Einsteiger gedacht.
   </li>
   <li>
      Framework-Code-Release: (apf-codepack-*):
      <br />
      Enth&auml;lt die notwendigen APF Dateien. Dieses Paket ist f&uuml;r den Produktiveinsatz
      gedacht.
   </li>
   <li>
      Beispiel-Konfigurationsdateien: (apf-configpack-*):
      <br />
      Enth&auml;lt nur Konfigurationsdateien f&uuml;r einige Module des APF, an denen man sich bei
      der Erstellung seiner Konfigurationen orientieren kann.
   </li>
</ul>
F&uuml;r dieses Tutorial wird das Framework-Code-Release verwendet, welches Sie nun herunterladen
k&ouml;nnen.

<h3 id="Chapter-4-Installation"><a href="#Chapter-4-Installation">4. Installation</a></h3>
Zuerst ist es wichtig die Ordnerstruktur zu verstehen. Im Tutorial wird davon ausgegangen, dass der
Document-Root (der Ordner der ge&ouml;ffnet wird wenn man <em>http://localhost/</em> im Browser aufruft)
unter <em>/xampp/htdocs</em> liegt.
<br />
<br />
Das APF ist so aufgebaut, dass nur eine einzige Datei (Bootstrap Datei) aufgerufen wird. Der Rest
wird &uuml;ber URL-Parameter gesteuert. F&uuml;r die Bootstrap Datei (z.B. <em>index.php</em>) legen
wir die Ordner <em>/xampp/htdocs/APF/sites/helloworld/</em> an. Hier werden au&szlig;erdem &ouml;ffentlich
zug&auml;ngliche Dateien platziert (z.B. Bilder).
<br />
<br />
Aus Sicherheitsgr&uuml;nden sollten die Dateien des APF nicht &ouml;ffentlich zug&auml;nglich sein,
denn sonst k&ouml;nnen Konfigurationsdateien einfach von au&szlig;en gelesen werden. Die sicherste
Variante ist es, wenn man die Dateien des APF oberhalb des Wurzelverzeichnisses ablegt. Sollte dies
aus irgendeinem Grund (wie z.B. einem Webspace, bei dem man nur  Zugriff auf das Wurzelverzeichnis
hat) nicht m&ouml;glich sein, fahren Sie bei Punkt 4.2 fort, wo eine zus&auml;tzliche Sicherung
erstellt wird, um den Zugriff von au&szlig;en zu unterbinden, andernfalls folgen Sie den Anweisungen
aus 4.1.

<h4 id="Chapter-4-1-Installation-ausserhalb-Root-Verzeichnis"><a href="#Chapter-4-1-Installation-ausserhalb-Root-Verzeichnis">4.1. Installation au&szlig;erhalb des Root-Verzeichnisses</a></h4>
Da das Root-Verzeichnis unter <em>/xampp/htdocs/</em> liegt, legen wir das Verzeichnis
<em>/xampp/APF/</em> an. Jetzt &ouml;ffnen wir das zuvor heruntergeladene Paket, und entpacken es
in das eben erstellte Verzeichnis.
<br />
<br />
Jetzt sollte man folgende Ordnerstruktur vorfinden:
<gen:highlight type="code">
/xampp/APF/apps/
    core/
    modules/
    tools/
</gen:highlight>
Wenn dem so ist, kann Punkt 4.2 &uuml;bersprungen werden.

<h4 id="Chapter-4-2-Installation-innerhalb-Root-Verzeichnis"><a href="#Chapter-4-2-Installation-innerhalb-Root-Verzeichnis">4.2. Installation innerhalb des Root-Verzeichnisse</a></h4>
Hierbei muss darauf geachtet werden, dass der Ordner in dem sich die APF Dateien befinden vor dem
Zugriff von au&szlig;en gesch&uuml;tzt werden muss. Wir haben ja schon das Verzeichnis 
<em>/xampp/htdocs/APF/</em> angelegt. Dort entpacken wir jetzt die zuvor heruntergeladene Datei.
Jetzt sollte die Ordnerstruktur
<gen:highlight type="code">
/xampp/htdocs/APF/apps/
    core/
    modules/
    tools/
</gen:highlight>
vorhanden sein.
<br />
<br />
Um das Verzeichnis vor dem Zugriff von au&szlig;en zu sch&uuml;tzen, legen wir die Datei
<strong>.htaccess</strong> unter <em>/xampp/htdocs/APF/apps/</em> an:
<gen:highlight type="shell">
# Zugriff von au&szlig;en unterbinden
Order allow,deny
deny from all
</gen:highlight>
<div class="hint">
   Beim &uuml;bertragen der .htaccess Datei via FTP muss die &uuml;bertragungsmethode auf ASCII
   gestellt werden, andernfalls kann es zu Problemen kommen.
</div>

<h3 id="Chapter-5-Erste-Schritte"><a href="#Chapter-5-Erste-Schritte">5. Erste Schritte</a></h3>
<div class="hint">
   Der Einfachheit wegen wird ab sofort auf den kompletten Pfad verzichtet. <em>/apps/</em> ist ab jetzt der
   gesch&uuml;tzte APF Ordner, und <em>/APF/</em> der &ouml;ffentlich zug&auml;ngliche Ordner.
</div>
<br />
Zuerst eine kurze Erkl&auml;rung der einzelnen Ordner:
<ul>
   <li>
      <strong>/apps/core/</strong>: Hier befinden sich alle Systemdateien des APF, welche zwingend
      notwendig sind.
   </li>
   <li>
      <strong>/apps/modules</strong>: Hier befinden sich optionale Module, welche das APF
      mitliefert. Diese m&uuml;ssen jedoch erst konfiguriert werden. Wie das geht kann unter
      den Tutorials auf der
      <a href="./?Seite=039-Mitgelieferte-Module" title="039-Mitgelieferte-Module">&Uuml;bersichts-Seite der vorhandenen Module</a>
      eingesehen werden.
   </li>
   <li>
      <strong>/apps/tools</strong>: Hier findet man viele kleinere Tools welche man verwenden kann.
   </li>
</ul>
Jetzt legen wir die Datei <strong>/APF/sites/helloworld/index.php</strong> an. Wir werden eine
einfache "Hallo Welt" Applikation schreiben, um die Funktionalit&auml;t zu erkl&auml;ren.
<br />
<br />
<div class="hint">
   Im Folgenden wird der Begriff <em>Namespace</em> statt der Bezeichung <em>Ordner</em> verwendet.
   Das hat folgenden Hintergrund: der Namespace ist eine relative Adressierung vom
   <strong>/apps</strong> Ordner aus. Beim Namespace m&uuml;ssen alle "/" im Ordner-Pfad durch "::"
   ersetzt werden.
</div>
<br />
Es muss nun der Namespace f&uuml;r das Template erstellt werden. Hierzu legen wir die Ordner
<strong>/apps/sites/helloworld</strong> an. Darin werden die Ordner <strong>/pres/templates</strong>
angelegt. Da das APF auf einem 3 Schichten Modell aufbaut (Pr&auml;sentation, Verwaltung und Daten),
steht das <strong>pres</strong> hier f&uuml;r die Pr&auml;sentationssschicht, in der unter dem Ordner
<strong>/templates</strong> die <strong>.html</strong> Templates gespeichert werden. Wir
ben&ouml;tigen f&uuml;r dieses Beispiel nur ein einziges Template:
<gen:highlight type="apf-xml">helloworld.html</gen:highlight>
In dieses Template schreiben wir jetzt einfach folgenden Inhalt:
<gen:highlight type="apf-xml">Hallo Welt! Hello World!</gen:highlight>
Jetzt editieren wir die zuvor angelegte index.php. Sie bekommt folgenden Inhalt (Erkl&auml;rung
folgt darunter):
<gen:highlight type="php">
// Page-Controller einbinden (f&uuml;r den unter 4.1 konfigurierten Ordner)
include_once('../../../APF/apps/core/pagecontroller/pagecontroller.php');

// Page-Controller einbinden (f&uuml;r den unter 4.2 konfigurierten Ordner)
//include_once('../../apps/core/pagecontroller/pagecontroller.php');

// Seite erzeugen
$page = new Page();

// Haupt-Template der Seite laden
$page->loadDesign('sites::helloworld','pres/templates/helloworld');

// Seite transformieren und ausgeben
echo $page->transform();
</gen:highlight>
Zuerst wird der Page-Controller eingebunden. Hier muss die Variante gew&auml;hlt werden, die bei der
Installation verfolgt wurde. Als n&auml;chstes wird ein neues Objekt von Page erzeugt. Daraufhin
wird das Template geladen welches wir eben erstellt haben. Der erste Parameter ist dabei der
Namespace, der zweite Parameter dann der Pfad zum Template, und der Name der Templatedatei. Namen
werden im APF immer ohne die Dateiendung angegeben, da die Konvention des Frameworks schon sagt, wie
diese lauten m&uuml;ssen (*.html f&uuml;r Templates, *.ini f&uuml;r Konfigurationsdateien, *.php
f&uuml;r PHP-Dateien). Zuletzt wird die Seite noch transformiert und ausgegeben.
<br />
<br />
Die genaue Funktionsweise des Page-Controller kann unter 
<a href="./?Seite=098-Pagecontroller" title="Page-Controller">Der APF Page-Controller</a>
nachgelesen werden.
<br />
<br />
Um das Ergebnis zu betrachten rufen wir
<gen:highlight type="apf-xml">http://localhost/APF/sites/helloworld/index.php</gen:highlight>
auf.
Dort sollte nun <em>Hallo Welt! Hello World!</em> erscheinen.

<h3 id="Chapter-6-Fazit"><a href="#Chapter-6-Fazit">6. Fazit</a></h3>
Jetzt sollte die grundlegende Funktionalit&auml;t des APF bekannt sein. Um die vielen anderen
Funktionen kennenzulernen, empfiehlt es sich noch ein paar weitere Tutorials zu lesen. Als
n&auml;chstes Tutorial schlage ich das
<a href="./?Seite=048-Webseite-erstellen" title="Webseite erstellen">Tutorial Webseite erstellen</a>
vor.

<div class="foreignAuthor">
   <img src="http://media.adventure-php-framework.org/content/ralf_schubert_screeze.gif" alt="Ralf Schubert findet das APF genial!"/>
   <p><em>Dieser Artikel wurde exklusiv f&uuml;r adventure-php-framework.org geschrieben.</em></p>
   <p class="author"><strong>&Uuml;ber den Autor:</strong></p>
   <p>
      <strong>Ralf Schubert</strong> ist begeisterter APF-Entwickler. F&uuml;r ihn bietet es viele Vorteile
      gegen&uuml;ber anderen Frameworks. Besonders gerne nutzt er die einfach M&ouml;glichkeit,
      wiederverwendbare Elemente zu erstellen.
   </p>
   <p>
      Um Neueinsteiger bei der Verwendung des APF zu unterst&uuml;tzen hat er ein Tutorial verfasst. Darin
      werden die ersten Schritte mit dem Framework zu erkl&auml;ren.
   </p>
</div>

<core:importdesign namespace="modules::comments::pres::templates" template="comment" categorykey="de_111" />