<doku:title parent="119" tags="generic or mapper,gorm,or,mapper,update" title="Generischer OR-Mapper - Update der Datenbank" urlname="Generischer-OR-Mapper-Update-der-Datenbank">
   Seit dem Release 1.11 ist ein Update-Tool f&uuml;r den Generic OR-Mapper verf&uuml;gbar,
   das die &Auml;nderungen an den Konfigurations-Dateien auf eine vorhandene Datenbank anwendet.
</doku:title>
<p>
   Seit dem Release 1.11 ist ein Update-Tool f&uuml;r den <int:link pageid="063" /> verf&uuml;gbar,
   das die &Auml;nderungen an den Konfigurations-Dateien auf eine vorhandene Datenbank anwendet.
</p>
<p>
   Sofern kein automatisiertes Update gew&uuml;scht ist, bietet die Klasse <em>GenericORMapperUpdate</em>
   zudem die M&ouml;glichkeit, die Update-Statements f&uuml;r eine manuelle Anwendung auszugeben.
   F&uuml;r gro&szlig;e Datenbanken wird ohnehin ein manuelles Update empfohlen, insbesondern wenn
   Indizes oder Spalten erzeut oder entfernt werden!
</p>
<div class="hint">
   Das Update-Tool besitzt derzeit noch die Einschr&auml;nkung, dass bei einigen MySQL-Versionen
   Spalten mit DEFAULT-Werten nochmals mit einem Update-Statement belegt werden, ob wohl sich die
   Definition nicht &auml;ndert. Dies wird - sofern m&ouml;glich - in den folgenden Versionen
   behoben. Die Tatsache stellt jedoch keine Einschr&auml;nkung der Funktion des Update-Tools dar!
</div>
<p>
   Das folgende Skript zeigt, wie ein Datenbank-Update mit Hilfe des <em>GenericORMapperUpdate</em>
   automatisiert vorgenommen werden kann. Eine Vorlage f&uuml;r dieses Skript befindet sich zudem
   im Ordner <em>/apps/modules/genericormapper/data/tools</em> des jeweiligen
   <em>apf-codepack-*</em> Releases und tr&auml;gt den Namen <em>update.php</em>. Dieses muss
   gem&auml;&szlig; den Bemerkungen unterhalb der Codebox f&uuml;r den entstprechenden Anwendungsfall
   angepasst werden. Hier das Setup-Skript im &Uuml;berblick:
</p>
<gen:highlight type="php">
// include page controller
require('../../apps/core/pagecontroller/pagecontroller.php');

// configure the registry if desired
$reg = &Singleton::getInstance('Registry');
$reg->register('apf::core','Environment','{ENVIRONMENT}');

// include SetupMapper
import('modules::genericormapper::data::tools','GenericORMapperUpdate');

// create update tool
$updateMapper = new GenericORMapperUpdate();

// set Context (important for the configuration files!)
$updateMapper->set('Context','{CONTEXT}');

// adapt storage engine (default is MyISAM)
$updateMapper->set('StorageEngine','MyISAM|INNODB');

// update database layout
$updateMapper->updateDatabase('{CONFIG_NAMESPACE}','{CONFIG_NAME_AFFIX}','{CONNECTION_NAME}');

// display statements only
$updateMapper->updateDatabase('{CONFIG_NAMESPACE}','{CONFIG_NAME_AFFIX}','{CONNECTION_NAME}',false);   
</gen:highlight>
<p>Die eingesetzten Platzhalter haben folgende Bedeutung:</p>
<ul>
  <li>
    <strong>{ENVIRONMENT}</strong>: Umgebungsvariable der Applikation. Diese wird bei der Adressierung
    von Konfigurationsdateien verwendet und muss auf den Wert gesetzt werden, der auch in der
    Zielanwendung verwendet wird. Siehe hierzu Kapitel
    <a href="./?Seite=033-Konfiguration" title="Konfiguration">Konfiguration</a>.
    <br />
    <br />
  </li>
  <li>
    <strong>{CONTEXT}</strong>: Context der Applikation. Dieser wird zur Addressierung der
    Konfigurationsdateien verwendet und muss auf den Wert gesetzt werden, der auch in der
    Zielanwendung verwendet wird. Siehe hierzu Kapitel
    <a href="./?Seite=033-Konfiguration" title="Konfiguration">Konfiguration</a>.
    <br />
    <br />
  </li>
  <li>
    <strong>{CONFIG_NAMESPACE}</strong>: Namespace, unter dem die Konfigurationsdateien f&uuml;r den
    OR-Mapper liegen (siehe Kapitel 2.2).
    <br />
    <br />
  </li>
  <li>
    <strong>{CONFIG_NAME_AFFIX}</strong>: Namenszusatz der Konfigurationsdateien (siehe Kapitel 2.1).
    <br />
    <br />
  </li>
  <li>
    <strong>{CONNECTION_NAME}</strong>: Name der Datenbankverbindung, die f&uuml;r das Setup genutzt
    werden soll.
    <br />
    <br />
  </li>
</ul>
<p>
   Weiterhin ist wichtig, dass die zu aktualisierende Datenbank bereits existiert und der in der
   Verbindungskonfiguration aufgef&uuml;hrte Benutzer <em>CREATE TABLE</em>-, <em>ALTER TABLE</em>-
   und, falls gew&uuml;nscht, <em>ALTER INDEX</em>-Rechte f&uuml;r diese besitzt. Wird nach der
   Ausf&uuml;hrung des Codes kein Fehler angezeigt, wurde das Setup erfolgreich abgeschlossen. Das
   Ergebnis kann dann beispielsweise mit phpMyAdmin oder dem MySQLAdmin &uuml;berpr&uuml;ft werden.
</p>
<div class="warn">
   Bitte beachten Sie folgende wichtige Grundregeln:
   <ul>
      <li>Gro&szlig;e Datenbanken sollten keinesfalls automatisiert aktualisiert werden!</li>
      <li>
         Bei der Umbenennung von Spalten werden spezifisch angelegte Indizes nicht beachtet und u.U.
         gel&ouml;scht!
      </li>
   </ul>
</div>
<br />
<core:importdesign namespace="modules::comments::pres::templates" template="comment" categorykey="de_128" />