<core:addtaglib namespace="sites::demosite::pres::taglib" prefix="doku" class="link" />
<font style="font-size: 26px; font weight: bold;">News</font>
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>16.03.2008 20:00</strong>
<br />
Mit dem heutigen Tag ist das Release 1.6-RC1 zur &ouml;ffentlichen Vorschau verf&uuml;gbar. Es
enth&auml;lt Bugfixes, sowie Erweiterungen im Bereich Datenbank-Abstraktion und des ServiceManagers.
Fehler des Releases bitte im Forum unter
<doku:link>http://forum.adventure-php-framework.org/de/viewforum.php?f=8</doku:link> reporten,
Anregungen und Feature-W&uuml;nsche k&ouml;nnen unter
<doku:link>http://forum.adventure-php-framework.org/de/viewforum.php?f=5</doku:link> diskutiert
werden.
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>15.01.2008 18:00</strong>
<br />
Seit heute ist ein neues Release ver&ouml;ffentlicht. Details k&ouml;nnen der
<a href="./?Seite=008-Downloads" title="Downloads">Downloadseite</a> entnommen werden.
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>29.12.2007 00:20</strong>
<br />
Zum heutigen Tag sind nun alle Inhalte der Dokumentation ins Englische &uuml;bersetzt. Neben den
&Uuml;bersetzungen wurden auch Korrekturen der deutschen Texte durchgef&uuml;hrt und Module
auf Mehrsprachigkeit umgestellt. Zudem enth&auml;lt das Kommentarmodul nun einen Captcha-Schutz.
Viel Spass beim St&ouml;bern!
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>18.11.2007 12:00</strong>
<br />
Die im Forum diskutierten BugFixes und &Auml;nderungen stehen ab jetzt im
<a href="./?Seite=008-Downloads" title="Downloads">Download-Bereich</a> zur Verf&uuml;gung.
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>04.11.2007 19:30</strong>
<br />
Als Arbeitsaufgabe aus dem Artikel <a href="./?Seite=049-PHP-Frameworks-im-Test" title="PHP Frameworks im Test">PHP Frameworks im Test</a>
ging das Fehlen eines Support-Forums hervor. Dieses wurde mit dem heutigen Tag nachgeholt. Unter
<a href="http://forum.adventure-php-framework.org/de" title="Forum" target="_blank">Forum</a> steht
nun ein Support- und Diskussionsforum bereit.
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>25.10.2007 22:00</strong>
<br />
Mit dem heutigen Tag steht nun endlich die finale Version des Artikels
<a href="./?Seite=049-PHP-Frameworks-im-Test" title="PHP Frameworks im Test">PHP Frameworks im Test</a>
zur Verf&uuml;gung.
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>18.09.2007 12:00</strong>
<br />
Ab heute stehen zu den Manual-Funktionen jeweils Kommentar-M&ouml;glichkeiten zur Verf&uuml;gung, die
genutzt werden k&ouml;nnen um Erfahrungen hinzuzuf&uuml;gen und Feedback zu geben.
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>19.08.2007 16:00</strong>
<br />
Wie bereits einer Auswahl von Beta-Testern angek&uuml;ndigt steht nun eine offizielle Beta-Version
des Adventure-PHP-Framework f&uuml;r PHP 5 bereit. Download und Release-Notes finden sich unter
<a href="./?Seite=008-Downloads" title="Downloads">Downloads</a>.
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>15.07.2007 01:00</strong>
<br />
Ab heute ist das Release 1.3 verf&uuml;gbar. Neben zahlreichen Improvements wurde das URL-Filtering
und der Bereich des Frontcontrollers komplett &uuml;berarbeitet. Ein ausf&uuml;hrliches Changelog
findet sich unter <a href="./?Seite=008-Downloads" title="Downloads">Downloads</a>.
<br />
Dar&uuml;ber hinaus wurde die Dokumentation in folgenden Punkten erg&auml;nzt und &Uuml;berarbeitet:
<ul>
  <li>Links generieren</li>
  <li>Frontcontroller</li>
  <li>Komponenten + Tools</li>
  <li>API-Dokumentation</li>
  <li>FAQs</li>
</ul>
Um die Arbeit mit der Referenz zu erleichtern wurde die Navigation innerhalb der Dokumentation
verbessert, eine Suche eingef&uuml;hrt und die Druck-Funktion korrigiert.
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>27.05.2007 15:30</strong>
<br />
Auf Grund der Hinweise einiger Benutzer wurden folgende &Auml;nderungen eingepfleget. Ein besonderer
Dank gilt an dieser Stelle den Mitglieder der Foren
<a href="http://www.phpfriend.de/forum/" title="PHPFriend Forum" target="_blank">PHPFriend</a> und
<a href="http://www.developers-guide.net/forums/" title="Developers-Guide" target="_blank">Developers-Guide</a>.
<ul>
  <li>
      Fehler im Build-Script behoben, auf Grund dessen einige Konfigurations-Dateien falsch dargestellt
      wurde.
  </li>
  <li>Links, die in einem neuen Fenster ge&ouml;ffnet werden, kommen nun komplett ohne JAVA-Script aus.</li>
  <li>Links in Men&uuml; und Content wurden mit Hover-Effekten belegt.</li>
  <li>Impressum wurde korrigiert und auf ein Minimum beschr&auml;nkt.</li>
  <li>Auf den Dokumentations-Seiten wurde eine Hilfs-Navigation eingef&uuml;hrt.</li>
  <li>URL-Rewriting wurde aktiviert.</li>
  <li>Meta-Tag-Definitionen wurden korrigiert.</li>
  <li>Source-Code wird nun direkt per Tag in die Seite eingebaut.</li>
  <li>
      Seite http://christian.zierpflanzenberatung.de wird nun automatisch auf
      http://www.adventure-php-framework.org weitergeleitet.</li>
</ul>
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>19.05.2007 15:00</strong>
<br />
Das G&auml;stebuch-Modul wurde um ein Verwaltungs-Backend erweitert. Dieses kann der Administrator
nach einem Login nutzen. Zur Demonstration wurde die Seite um ein Demo-G&auml;stebuch bereichert, auf
der der interessierte Besucher das Backend testen kann. Einfach auf die Seite
<a href="./?Seite=007-Demo-Gaestebuch" title="Demo-G&auml;stebuch">Demo-G&auml;stebuch</a> wechseln. Das
G&auml;stebuch ist mit einem entsprechenden Hinweis ausgestattet.
<br />
Die Dokumentation des G&auml;stebuchs wurde um eine dritten Seite erweitert, die das Design des
Backends beschreibt.
<br />
<br />
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>17.05.2007 20:06</strong>
<br />
Ab heute steht die Dokumentations-Webseite mit neuem Design und neuen bzw. &uuml;berarbeiteten
Inhalten zur Verf&uuml;gung.
<br />
<br />
<strong>Neu</strong> sind:
<ul>
  <li>Einf&uuml;hrung</li>
  <li>Grundlagen</li>
  <li>Klassen</li>
  <li>Templates</li>
  <li>Hallo Welt!</li>
  <li>Benchmark</li>
</ul>
<strong>Aktualisiert</strong> wurden:
<ul>
  <li>Litaratur</li>
  <li>TagLib-Dokumentation</li>
  <li>Konfiguration</li>
</ul>
<br />

<img src="/frontend/media/design/elephant_small.png" border="0" alt="Elephant" /> <strong>20.04.2007 18:23</strong>
<br />
Da die Offline-Download-Version des &Ouml;fteren f&uuml;r mich nicht reproduzierbare Fehler erzeugt
hat, habe ich unter <a href="./?Seite=008-Downloads" title="Downloads">Downloads</a> eine auf XAMPP
basierende Version f&uuml;r Windows-Nutzer generiert, die nach dem Entpacken unter einem beliebigen
Laufwerk lauff&auml;hig sein sollte.