<doku:title tags="grundlagen,pattern,architektur,aufbau ordner struktur,templates,basis konfiguration,registry,dokumentation,framework" title="Grundlagen" urlname="Grundlagen">
  Auf der vorliegenden Seite werden die Grundlagen des APF vermittelt. Zun&auml;chst wird die
  Architektur und die darin eingesetzten Pasttern erl&auml;utert, anschlie&szlig;end wird auf die
  Struktur des Quellcodes und die Themen Templates und BAsis-Konfiguration eingegangen.
</doku:title>
<core:importdesign namespace="sites::apfdocupage::pres::templates::perspectives::content::voting" template="voting" />
<a name="1-Einfuehrung"></a><h3>1. Einf&uuml;hrung</h3>
Das vorliegende Framework versteht sich als Hilfsmittel f&uuml;r die Implementierung von
objektorientierten, generischen und wiederverwendbaren PHP-Applikationen. Es werden eine Reihe von
wichtigen OO-Design-Pattern implementiert und das Framework bietet L&ouml;sungen f&uuml;r bekannte
Problemstellungen:
<ul>
  <li>
    <strong>Model-View-Controller-Pattern:</strong>
    <br />
    Das Model-View-Controller-Pattern ist ein Pattern der Pr&auml;sentations-Schicht. Es zielt darauf
    ab ein flexibles Programmdesign zu generieren. Insbesondere diktiert es eine strikte Trennung der
    Bereiche <strong>Model</strong>, <strong>View</strong> und <strong>Controller</strong>. Damit
    wird die Anwendung f&uuml;r sp&auml;tere &Auml;nderungen einfach pfleg- und erweiterbar. Zudem
    reduziert sich die Komplexit&auml;t der einzelnen Komponenten und einzelne Softwareteile werden
    wiederverwendbar.
    <br />
    Das Modell enth&auml;lt dabei die darzustellenden Daten oder Informationen &uuml;ber das Verhalten der
    Software. Der View beschreibt die Art der Darstellung und wird in der Regel durch Template-Dateien
    repr&auml;sentiert. Der Controller kennt sowohl das Model als auch den View und kann durch
    Kenntnis dieser den View mit den gew&uuml;nschten Daten aufbauen.
    <br />
    <br />
    Siehe hierzu auch <a href="http://de.wikipedia.org/wiki/MVC" title="MVC-Pattern bei wikipedia.org">http://de.wikipedia.org/wiki/MVC</a>.
    <br />
    <br />
  </li>
  <li>
    <strong>Composite-Pattern:</strong>
    <br />
    Die Objekte der Pr&auml;sentations-Schicht sind alle vom zentralen Objekt <em>coreObject</em>, bzw.
    vom Objekt <em>Document</em> abgeleitet. Auf Grund dieser Tatsache k&ouml;nnen beliebige Objekte,
    die von <em>Document</em> erben in den Objektbaum einer Seite eingeh&auml;ngt werden. So kann die
    Pr&auml;sentations-Schicht um beliebige Elemente auf einfache Art und Weise erweitert werden.
    <br />
    <br />
    Siehe hierzu auch <a href="http://en.wikipedia.org/wiki/Composite_pattern" title="Composite Pattern bei wikipedia.org">http://en.wikipedia.org/wiki/Composite_pattern</a>.
    <br />
    <br />
  </li>
  <li>
    <strong>3-Schicht-Architektur:</strong>
    <br />
    Wie bereits angesprochen, unterst&uuml;tzt das Framework die Implementierung von Applikationen in
    der 3-Schicht-Architektur. Diese sieht vor, dass Anwendungen in die Schichten Pr&auml;sentation,
    Gesch&auml;fts-Logik und Daten-Schicht unterteilt sind die alle f&uuml;r sich genommen eine bestimmte
    Funktionalit&auml;t kapseln. Die Pr&auml;sentations-Schicht - oder kurz genannt "pres" - ist f&uuml;r
    die Darstellung der Applikation in einer (HTML-)GUI zust&auml;ndig. Sie kennt alle HTML-Elemente und
    ebenso die Business-Schicht (biz), die der Pr&auml;sentations-Schicht Daten und Informationen zur
    Art und Inhalt der Darstellung liefert. Innerhalb der biz-Schicht werden die Gesch&auml;ftsprozesse
    der Anwendung gekapselt und ausgef&uuml;hrt. Die Datenschicht besch&auml;ftigt sich einzig und
    allein mit der Daten-Accquise und -Persistenz. Hierzu kennt sie die Datenquelle und besitzt
    Mechanismen mit denen Daten aus der Datenquelle gelesen und als auch gespeichert werden k&ouml;nnen.
    <br />
    <br />
  </li>
  <li>
    <strong>Domain-Object-Pattern:</strong>
    <br />
    Das Domain-Object-Pattern beschreibt, dass Daten, die in einer Anwendung verarbeitet werden in
    dedizierten Daten-Objekten gehalten werden. Das Pattern wird in der Regel in Verbindung mit dem
    Data-Mapper-Pattern verwendet. Die Kommunikations-Objekte zwischen den oben ganannten Schichten
    sollte immer das Domain-Object sein. Ein "Domain-Object" kann in der realen Anwendung auch eine
    Liste von Domain-Objekten oder ein Baum von unterschiedlichen Domain-Objekten sein. Die Auspr&auml;gung
    ist abh&auml;ngig von der Anwendung.
    <br />
    <br />
  </li>
  <li>
    <strong>Data-Mapper-Pattern:</strong>
    <br />
    Ein Data-Mapper ist per se ein "&Uuml;bersetzer". Er &Uuml;bersetzt das Datenmodell der Datenbank
    in das Datenmodell der Applikation. Diese m&uuml;ssen nicht zwangsl&auml;ufig &uuml;bereinstimmen
    und tun es in vielen Anwendungsf&auml;llen auch nicht. Beispiel: In einer Anwendung werden Personen
    und deren Adressen verwaltet. Das Datenmodell hat f&uuml;r das Objekt "Person" und das Objekt
    "Adresse" je eine eigene Tabelle. Um die Zugeh&ouml;rigkeit zwischen den beiden Objekten abbilden
    zu k&ouml;nnen existiert eine dritte Tabelle - die Beziehungstabelle. M&ouml;chte die Anwendung
    nun das Objekt "Person" <strong>mit</strong> seiner Adresse laden, so muss der Data-Mapper zuerst
    die Person und danach anhand der Beziehung die Adresse zum Objekt hinzuladen. Beim Speichern des
    Objekts Person geht der Data-Mapper den Weg umgekehrt und persistiert jeweils Adresse und
    anschlie&szlig;end die Daten des Objekts "Person".
    <br />
    <br />
  </li>
</ul>
<div style="border: 2px solid #777BB4; font-family: Arial, Helvetica, sans-serif; padding: 10px; background-color: #eeeeee;">
Das <strong>Adventure-PHP-Framework</strong> unterst&uuml;tzt den Programmierer dabei in allen genannten
Design-Modellen. Das Framework versteht sich bewusst als Programmier-Hilfe und <strong>nicht</strong>
als fertige Anwendung, die lediglich konfiguriert werden muss. Das Software-Design kann nur vom
Entwickler kommen, das Framework kann den Entwickler nur bei der Implementierung unterst&uuml;tzen!
</div>
<br />
<br />
<a name="2-Aufbau-und-Bedeutung-Ordnerstruktur"></a><h3>2. Aufbau und Bedeutung der Ordner-Struktur</h3>
Wie in der objektorientierten Welt &uuml;blich, sind die Komponenten des Frameworks in einer nach
Abh&auml;ngigkeit und Bedeutung strukturierten Ordnern untergebracht. Hier bei definiert der
Ordnername das Paket und der Dateiname den Namen der Klasse. Die relevanten Dateien k&ouml;nnen
innerhalb von Programmteilen mit der Funktion <strong>import()</strong> eingebunden werden.
<br />
<br />
In den Release-Paketen sind folgende Ordner-Strukturen enthalten:
<br />
<code:highlight>
apps/ (<em>Verzeichnis alle Quellcode-Dateien</em>)
     [config/ (<em>Verzeichnis f&uuml;r Konfigurationsdateien</em>)]

     core/ (<em>Verzeichnis f&uuml;r die Core-Komponenten</em>)
          benchmark/
          configuration/
          database/
          errorhandler/
          filesystem/
          filter/
          frontcontroller/
          logging/
          pagecontroller/
          service/
          session/
          singleton/

     modules/ (<em>Verzeichnis f&uuml;r die Module</em>)
             comments/
             guestbook/
             kontakt4/
             pager/
             socialbookmark/

     [sites/ (<em>Verzeichnis f&uuml;r Webseitendateien</em>)]

     tools/ (<em>Verzeichnis f&uuml;r die Tools-Komponenten</em>)
           cache/
           datetime/
           form/
                taglib/
           html/
                taglib/
           image/
           link/
           mail/
           string/
           validator/
           variablen/
</code:highlight>
Die Ordner <strong>core</strong> und <strong>tools</strong> beinhalten die Kern-Bestandteile des
Frameworks und werden mit jedem Release ausgeliefert. Darin befinden sich u.a. die Implementierung
des Page-Controllers (<em>/apps/core/pagecontroller/</em>), des configurationManagers
(<em>/apps/core/configuration/</em>) oder Tools wie ein mailSender (<em>/apps/tools/mail/</em>) bzw.
der linkHandler (<em>/apps/tools/link/</em>).
<br />
<br />
Der Ordner <strong>modules</strong> beinhaltet Module, die auf den <strong>core</strong>- und
<strong>tools</strong>-Komponenten aufsetzen. Dazu z&auml;hlen ein G&auml;stebuch und ein
Kontaktformular, das in von Ihnen implementierte Webseiten oder Web-Applikation eingebaut werden kann.
<br />
<br />
Unterhalb von <strong>config</strong> werden Konfigurationsdateien abgelegt, die in den unterschiedlichen
Teilen der Software zum Einsatz kommen. Unter Konfigurationsdateien fallen Sprachdateien,
Parameterdefinitionen f&uuml;r Applikationen oder auch MySQL-Statement-Dateien.
<br />
<br />
Da es ein Punkt des Codexes des Frameworks ist m&ouml;glichst immer wiederverwendbare Code-Teile
zu erstellen, wird zwischen den Ordnern <strong>modules</strong> und <strong>sites</strong>
unterschieden. Der Ordner <strong>modules</strong> beinhaltet &uuml;ber alle <strong>sites</strong>
hinweg einsetzbare Software-Teile, der Ordner <strong>sites</strong> die eigentlichen Webseiten-Projekte.
Als ein Webseiten-Projekt wird nicht nur eine Ausgabe-Seite angesehen, sondern z.B. auch ein Backend
(CMS).
<br />
<br />
Die <a href="./?Seite=002-API-Dokumentation" title="API-Dokumentation">API-Dokumentation</a> beschreibt
die Inhalte der Ordner nochmals genauer.
<br />
<br />
<br />
<a name="3-Aufbau-einer-einfachen-Applikation"></a><h3>3. Aufbau einer einfachen Applikation</h3>
Das Framework arbeitet im sogenannten <strong>"Postback"-Modus</strong>. Das bedeutet, dass ein
Webseiten-Projekt in der Regel eine zentrale Datei (meist <em>index.php</em>, da diese im Webserver als
DirectoryIndex konfiguriert ist) besitzt und &uuml;ber diese alle Anfragen abgewickelt werden. Ist
dieses Verhalten nicht gew&uuml;nscht, k&ouml;nnen auch weitere Dateien gem&auml;&szlig; ihren Aufgaben
definiert werden. Es hat sich jedoch als praktikabel erwiesen, mit einer Bootstrap-Datei zu arbeiten,
da sich dadurch der Pflegeaufwand der Code-Dateien minimiert.
<br />
<br />
<br />
<a name="3-1-Aufbau-Bootstrapdatei"></a><h4>3.1. Aufbau einer index.php</h4>
Eine einfache Applikation besteht grunds&auml;tzlich aus einer Bootstrap-Datei und einem Master-Template.
Die Bootstrap-Datei l&auml;dt das Template, erstellt daraus eine Seite, die anschlie&szlig;end
transformiert und ausgegeben wird. Im Master-Template ist definiert, wie die Applikation aufgebaut
ist und welche weiteren Templates, TagLibs oder Module inkludert werden.
<br />
<br />
Eine typische <strong>index.php</strong> enth&auml;lt folgende Code-Teile:
<php:highlight>
   // Page-Controller einbinden
   include_once('./apps/core/pagecontroller/pagecontroller.php');

   // Seite erzeugen
   $page = new Page();

   // Seiten-Struktur aufbauen
   $page->loadDesign('{1}','{2}');

   // Seite transformieren und ausgeben
   echo $page->transform();
</php:highlight>
Den mit <strong>{x}</strong> gekennzeichneten Platzhaltern kommt dabei folgende Bedeutung zu:
<ul>
  <li>
    <strong>{2}</strong>: Namespace zum Basis-Template bzw. Context. Um ein Design laden zu k&ouml;nnen
    sind die Angaben "Namespace" bzw. "Pfad" und "Designname" notwendig. Der erste Teil ("Namespace"
    bzw. "Pfad") wird zugleich als Context f&uuml;r Konfigurationsbelange eingesetzt (siehe hierzu
    <a href="./?Seite=033-Konfiguration" title="Konfiguration">Konfiguration</a>).
  </li>
  <li>
    <strong>{3}</strong>: Name des Basis-Templates. Hier kann entweder der Name des Basis-Templates
    ohne dessen Endung oder ein Sub-Pfad incl. Name des Basis-Templates ohne Endung angegeben werden.
  </li>
</ul>
<br />
<a name="3-2-Aufbau-Basistemplate"></a><h4>3.2. Aufbau des Basis-Templates</h4>
Templates spielen im Adventure PHP Framework eine entscheidende Rolle. Abstrakter betrachtet ist
dabei ein Baum-Knoten einer Webseite eine kleine MVC-Einheit, die aus einem Model (zumeist dem Model der
Applikation oder Webseite), dem View(-Template), einem XML-/HTML-Template, und einem Controller
(DocumentController), falls erw&uuml;nscht, besteht. Den Kern des Frameworks stellt der PageController
dar, der aus einem Template einen Objektbaum erzeugt und daf&uuml;r sorgt, dass bei der Transformation
die entsprechenden Controller ausgef&uuml;hrt werden.
<br />
<br />
Mit der Gestaltung der Templates definiert der Entwickler quasi die Komplexit&auml;t der Seite und
den Aufbau des Objektbaums. In der <strong>index.php</strong> wird mit der Methode
<strong>loadDesign()</strong> ein initiales Template einer Applikation oder eines Modules geladen,
das die oberste Ebene des Aufbaus der Seite definiert. Jedes eingebundene Template bildet dabei einen
Kind des aktuellen Baum-Knotens. Die Verschachtelungstiefe ist dabei nicht beschr&auml;nkt. Die
folgende Codebox zeigt ein einfaches Template, das als Layout einer Webseite dienen kann:
<code:highlight>
&lt;html&gt;
&lt;head&gt;
  &lt;title&gt;Demo&lt;/title&gt;
  &lt;meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" /&gt;
&lt;/head&gt;
&lt;body&gt;
...
&lt;/body&gt;
&lt;/html&gt;
</code:highlight>
Weiterf&uuml;hrende Beispiele zu Templates k&ouml;nnen den Kapiteln
<a href="./?Seite=014-Hallo-Welt" title="Hallo Welt!">Hallo Welt!</a> und
<a href="./?Seite=047-Templates" title="Templates">Templates</a> entnommen werden, das Tutorial
<a href="./?Seite=048-Webseite-erstellen" title="Webseite erstellen">Webseite erstellen</a> gibt eine
weitere Einf&uuml;hrung in das Erstellen von Web-Seiten und -Applikationen.
<br />
<br />
<br />
<a name="3-3-Basiskonfiguration"></a><h4>3.3. Basis-Konfiguration</h4>
Im Gegensatz zu fr&uuml;heren Versionen (&lt; 1.7) ben&ouml;tigt das Framework zun&auml;chst keine
weitere Konfiguration. Intern werden jedoch einige Basis-Konfigurationsparameter im Namespace
<strong>apf::core</strong> der <strong>Registry</strong> verwaltet. M&uuml;ssen diese f&uuml;r den
speziellen Anwendungsfall angepasst werden, so kann das in der Boostrap-Datei wie nachfolgend
dargestellt bewerkstelligt werden. Die Registry dient nicht nur als zentraler Informationspool f&uuml;r
das Framework, sondern kann auch f&uuml;r die Steuerung von konkreten Anwendungen eingesetzt werden.
<php:highlight>
   // Page-Controller einbinden
   include_once('./apps/core/pagecontroller/pagecontroller.php');

   // Instanz der Registry beziehen
   $Reg = &Singleton::getInstance('Registry');

   // Umgebungsvariable manipulieren
   $Reg->register('apf::core','Environment','MY_ENV');

   // Basis-Pfad der Applikation manipulieren
   $Reg->register('apf::core','URLBasePath','http://mybaseurl.de');

   // URLRewriting-Modus &auml;ndern (true: URL wird mit / dargestellt, false: "normale" URLs)
   $Reg->register('apf::core','URLRewriting',true);

   // Log-Verzeichnis anpassen
   $Reg->register('apf::core','LogDir','/Pfad/zu/meinem/Log/Verzeichnis');

   // Seite erzeugen
   $page = new Page();

   // Seiten-Struktur aufbauen
   $page->loadDesign('{1}','{2}');

   // Seite transformieren und ausgeben
   echo $page->transform();
</php:highlight>
Die aufgef&uuml;hrten Parameter haben folgende Bedeutung:
<ul>
  <li>
    <strong>Environment</strong>: <em>(verwendet von: configurationManager, MySQLxHandler, MySQLHandler, SQLiteHandler, ...)</em>
    <br />
    <br />
    Jede Konfigurations-Datei besteht aus vier unterschiedlichen Bestandteilen:
    <br />
    <br />
    <ul>
      <li>Namespace: Ordner, unterhalb dem alle Konfigurationsdateien dieser Anwendung liegen</li>
      <li>Context: Aktueller Context der Applikation</li>
      <li>Umgebung: z.B. f&uuml;r Entwicklung, Test und Live</li>
      <li>Dateinamen: Dateiname der Konfigurationsdatei</li>
    </ul>
    <br />
    Diese Abstraktion wurde eingef&uuml;hrt, damit eine Anwendung oder ein Modul in unterschiedliche
    andere Anwendungen oder Module eingebunden werden kann und auf unterschiedlichen Systemen zur
    gleichen Zeit ohne &Auml;nderung des Quellcodes lauff&auml;hig ist. F&uuml;r das Laden von
    Konfigurationen gibt es jedoch standardisierte Methoden, so dass sich der Programmierer darum nicht
    mehr k&uuml;mmern muss. Weiterf&uuml;hrendes dazu kann im Kapitel
    <a href="http://www.adventure-php-framework.org/Seite/033-Konfiguration/~/sites_demosite_biz-action/setReferrer/lang/de" target="_blank" title="Konfiguration">Konfiguration</a>
    nachgelesen werden.
    <br />
    <br />
    <strong>Standard-Wert:</strong> &quot;DEFAULT&quot;
    <br />
    <br />
    <br />
  </li>
  <li>
    <strong>URLBasePath</strong>: <em>(verwendet von: bbCodeParser, socialBookmarkManager, Suche, ...)</em>
    <br />
    <br />
    Viele Module verlinken auf sich selbst oder ander Bereiche eines Moduls oder einer Webseite. Aus
    diesem Grund muss bekannt sein, wie die Basis-URL der Seite lautet. Der Registry-Wert
    URLBasePath definiert diese.
    <br />
    <br />
    <strong>Standard-Wert:</strong> &quot;HTTP_HOST-Wert des $_SERVER-Arrays&quot;
    <br />
    <br />
    <br />
  </li>
  <li>
    <strong>URLRewriting</strong>: <em>(verwendet von: PageController, FrontController, linkHandler, frontcontrollerLinkHandler, ...)</em>
    <br />
    <br />
    Der vorliegende PageController unterst&uuml;tzt URL-Rewriting. Unter URL-Rewriting versteht der
    Autor die Verwendung von URLs der Form <em>http://www.domain.tld/param1/value1/param2/value2</em>
    statt <em>http://www.domain.tld?param1=value1&amp;param2=value2</em>. Ist der Wert auf "true" gesetzt,
    so werden die mit den <strong>linkHandler</strong> und <strong>frontcontrollerLinkHandler</strong>
    generierten Links in der rewriteten Form ausgegeben.
    <br />
    <br />
    <strong>Standard-Wert:</strong> &quot;false&quot;
    <br />
    <br />
    <br />
  </li>
  <li>
    <strong>LogDir</strong>: <em>(verwendet von: Logger, ...)</em>
    <br />
    <br />
    Um zentrales Logging zu erm&ouml;glichen, muss der Pfad, in den Log-Dateien geschreiben werden
    zentral bekannt gegeben werden. Der Pfad wird von der Klasse <strong>Logger</strong> verwendet.
    <br />
    <br />
    <strong>Standard-Wert:</strong> &quot;./logs&quot;
    <br />
    <br />
    <br />
  </li>
  <li>
    <strong>LibPath</strong>: <em>(verwendet von: bbCodeParser, ...)</em>
    <br />
    <br />
    Die Direktive <strong>LibPath</strong> speichert den Basis-Pfad, in dem die Programmdateien
    abgelegt wurden. Der Pfad wird dynamisch gesetzt und ist nur f&uuml;r den lesenden Zugriff
    freigegeben.
    <br />
    <br />
  </li>
</ul>
<br />
<core:importdesign namespace="modules::comments::pres::templates" template="comment" categorykey="de_013" />