<doku:title tags="erweiterung,funktionen,formular,taglibs,controller," title="Erweiterung der Formularfunktionen" urlname="Erweiterung-der-Formularfunktionen">
  Das Adventure PHP Framework beinhaltet bereits alle &uuml;blichen Formular-Elemente, es sind jedoch
  sicher nicht alle Spezialf&auml;lle abgedeckt. Um die Funktionen der mitgelieferten Formular-Tags
  einfach erweitern zu k&ouml;nnen, wurde im Release 1.7-BETA das Tag form:addtaglib eingef&uuml;hrt.
  Mit Hilfe dieser Taglib k&ouml;nnen beliebige weitere Taglibs eingebunden werden.
</doku:title>
<core:importdesign namespace="sites::apfdocupage::pres::templates::perspectives::content::voting" template="voting" />
<a name="1-Einleitung"></a><h3>1. Einleitung</h3>
Das Adventure PHP Framework beinhaltet bereits alle &uuml;blichen Formular-Elemente, es sind jedoch
sicher nicht alle Spezialf&auml;lle abgedeckt. Um die Funktionen der mitgelieferten Formular-Tags
einfach erweitern zu k&ouml;nnen, wurde im Release 1.7-BETA das Tag <strong>&lt;form:addtaglib /&gt;</strong>
eingef&uuml;hrt. Mit Hilfe dieser Taglib k&ouml;nnen beliebige weitere Taglibs eingebunden werden.
Diese k&ouml;nnen dann dazu genutzt werden, die f&uuml;r den aktuellen Anwendungsfall gew&uuml;nschte
Funktionalit&auml;t nachzur&uuml;sten.
<br />
<br />
Das vorliegende Tutorial m&ouml;chte an Hand von zwei Beispielen aufzeigen, wie der neue Tag genutzt
werden kann und welche M&ouml;glichkeiten sich dadurch ergeben. Im ersten Beispiel wird ein einfaches
Tag vorgestellt, mit dem das Datum im Formular als verstecktes Feld mitgef&uuml;hrt wird und das
Formular auf invalid setzt, wenn dieses innerhalb von einer konfigurierbaren Zeit abgeschickt wird.
Das dritte Kapitel zeigt, wie mit ein CAPTCHA-Tag implementiert werden kann.
<br />
<br />
<br />
<a name="2-Anti-SPAM-Tag"></a><h3>2. Anti-SPAM-Tag</h3>
<a name="2-1-Idee"></a><h4>2.1. Idee</h4>
Eine sehr einfache, jedoch verh&auml;ltnism&auml;&szlig;ig wirkungsvolle M&ouml;glichkeit, einen
SPAM-Schutz f&uuml;r ein Formular zu erstellen, ist es, die Zeit zu messen, die ein Benutzer
ben&ouml;tigt, um ein Formular auszuf&uuml;llen. Wird das Formular in zu kurzer Zeit ausgef&uuml;llt
- etwa durch einen Bot - so wird das Formular als invalide gekennzeichnet und nicht abgeschickt. Wird
mindestend die konfigurierte Zeit f&uuml;r das Ausf&uuml;llen ben&ouml;tigt, wird das Abschicken
akzeptiert.
<br />
<br />
Nachteil dieser Vorgehensweise ist, dass die Zeit, die als minimale Ausf&uuml;llzeit hinterlegt wird,
empirisch bestimmt werden muss. Das kann im schlechtesten Fall dazu f&uuml;hren, dass ein Benutzer
ein Formular nochmals abschicken muss.
<br />
<br />
<br />
<a name="2-2-Umsetzung"></a><h4>2.2. Umsetzung</h4>
F&uuml;r die Umsetzung der unter 2.1. beschriebenen Idee wird im Folgenden ein neues Tag erstellt,
das das Formular als invalid kennzeichnet, wenn die Zeit zwischen Aufruf und Absenden zu kurz ist. Da
jedes Formular eine individuelle Ausf&uuml;llzeit besitzt, wird im Tag ein Attribut vorgesehen, mit
dem die Ausf&uuml;llzeit konfigurierbar gestaltet wird. Die Signatur des Tags hat damit folgende
Gestalt:
<pre class="tagexample">
&lt;form:antispam minfilltime="..." /&gt;
</pre>
Vor der Verwendung des Tags muss dieser innerhalb des <strong>&lt;html:form /&gt;</strong>-Tags per
<pre class="tagexample">
&lt;form:addtaglib namespace="..." prefix="form" class="antispam" &gt;
</pre>
bekannt gemacht werden.
<br />
<br />
Wie im Tutorial <a href="./?Seite=045-TagLibs-erstellen" title="Eigene TagLibs erstellen">TagLibs erstellen</a>
beschrieben ist, muss f&uuml;r jeden Tag eine TagLib-Implementierung erstellt werden. Der Name der
TagLib-Klasse ergibt sich dabei aus dem Pr&auml;fix und der Klasse des Tags. Die Implementierung des
Anti-Spam-Tags lautet damit <strong>form_taglib_antispam</strong>. Die Aufgabe der Klasse ist es nun,
ein verstecktes Formularfeld hinzuzuf&uuml;gen, das speichert, wann das Formular ausgegeben worden
ist. Weiterhin muss die Zeit zwischen dem letzten Request und der aktuellen Zeit vergleichen und bei
Bedarf das Formular benachrichtigt werden. Der Code der Klasse stellt sich damit wie folgt dar:
<php:highlight>
class form_taglib_antispam extends ui_element
{

   function form_taglib_antispam(){
   }

   function onAfterAppend(){

      // Attribute validieren
      if(!isset($this->__Attributes['minfilltime'])){
         $FormName = $this->__ParentObject->getAttribute('name');
         trigger_error('[form_taglib_antispam::onAfterAppend()] There is not attribute "minfilltime"
         given in the anti spam tag definition in form "'.$FormName.'"! Please provide the attribute
         mentioned containing the time in seconds the user needs to fill in the form.');
       // end if
      }

      // Formular als invalide markieren, falls die minimale Ausfuellzeit unterschritten wurde
      $AntiSpamName = $this->__getAntiSpamName();

      if(isset($_REQUEST[$AntiSpamName])){

         // Informationen ueber die aktuelle und die Zeit des letzten Aufrufs sammeln
         $CurrentTime = date('U');
         $PreviousTime = $_REQUEST[$AntiSpamName];
         $MinFillTime = $this->__Attributes['minfilltime'];

         // Formular als invalid markieren, falls notwenig
         if(($CurrentTime - $MinFillTime) < $PreviousTime){
            $this->__ParentObject->set('isValid',false);
          // end if
         }

       // end if
      }

    // end function
   }

   function transform(){
      return '<input type="hidden" name="'.$this->__getAntiSpamName().'" value="'.date('U').'" />';
    // end function
   }

   function __getAntiSpamName(){
      return strtolower($this->__ParentObject->getAttribute('name')).'_antispam';
    // end function
   }

 // end class
}
</php:highlight>
Die private Methode <strong>__getAntiSpamName()</strong> generiert den Namen des Feldes aus dem Namen
des Formulars und dem Zusatz <strong>_antispam</strong>. Da der Name hart verdratet ist, darf das
Anti-SPAM-Tag nur einmal pro Formular verwendet werden, da es sonst zu &Uuml;berlagerungen kommt.
<br />
<br />
<br />
<a name="antispam"></a><h4>2.3. Beispiel</h4>
Wird der Button des Beispiel-Formulars innerhalb von weniger als 10 Sekunden geklickt, wird die
Eingabe nicht akzeptiert und das Formular als invalid gekennzeichnet.
<br />
<br />
<center>
  <div style="border: 1px dotted gray; width: 200px; padding: 5px; background-color: #efefef;">
    <core:importdesign namespace="sites::apfdocupage::pres::templates::perspectives::content" template="form_antispam_example" />
  </div>
</center>
<br />
<br />
Ein Manko der oben gezeigten Implementierung ist, dass ein auf Grund einer zu kurzen Ausf&uuml;llzeit
als invalid gekennzeichnetes Formular beim zweiten Absenden erneut als invalid gekennzeichnet wird,
da das Formular nach dem ersten Ausf&uuml;llen bereits gef&uuml;llt ist. Um dieses Problem zu umgehen,
sollte der Status des Formulars ("<em>Wurde das Formular schon einmal abgesendet?</em>") in der Session
mitgef&uuml;hrt werden.
<br />
<br />
<br />
<a name="3-CAPTCHA-Tag"></a><h3>3. CAPTCHA-Tag</h3>
<a name="3-1-Idee"></a><h4>3.1. Idee</h4>
&Auml;hnlich dem im deutschsprachigen Forum unter
<doku:link>http://forum.adventure-php-framework.org/de/viewtopic.php?p=125#p125</doku:link>
vorgestellten Konzept, soll in diesem Tutorial ein Tag erstellt werden, der zur erweiterten
Validierung in ein Formular eingebunden werden kann. Der Tag soll zur generischen Verwendbarkeit
folgende Attribute unterst&uuml;tzen:
<ul>
  <li>
    <strong>button</strong>: Name des Buttons auf dessen Klick eine Validierung durchgef&uuml;hrt
    werden soll.
  </li>
  <li>
    <strong>validate</strong>: "true", falls eine Validierung durchgef&uuml;hrt werden soll, "false"
    oder fehlendes Attribut, wenn keine Validierung gew&uuml;nscht ist.
  </li>
  <li>
    <strong>image_class</strong>: CSS-Klasse f&uuml;r das Captcha-Bild
  </li>
  <li>
    <strong>image_style</strong>: CSS-Stile f&uuml;r das Captcha-Bild
  </li>
  <li>
    <strong>text_class</strong>: CSS-Klasse f&uuml;r das Text-Feld
  </li>
  <li>
    <strong>text_style</strong>: CSS-Stile f&uuml;r das Text-Feld
  </li>
</ul>
Aus den genannten Anforderungen ergibt sich folgende Tag-Beschreibung:
<pre class="tagexample">
&lt;form:captcha
            button = ""
            [validate = ""]
            [image_class = ""]
            [image_style = ""]
            [text_class = ""]
            [text_style = ""]
/&gt;
</pre>
<br />
<a name="3-2-Umsetzung"></a><h4>3.2. Umsetzung</h4>
Um den Tag verwenden zu k&ouml;nnen, muss dieser dem Formular per
<pre class="tagexample">
&lt;form:addtaglib namespace="modules::captcha::pres::taglib" prefix="form" class="captcha" &gt;
</pre>
bekannt gemacht werden.
<br />
<br />
<br />
<a name="captcha"></a><h4>3.3. Beispiel</h4>
Das folgende Formular zeigt die Einsatzm&ouml;glichkeit des Tags. Aus Sicherheitsgr&uuml;nden
generiert der Tag bei jedem Aufruf einen neuen Captcha-String.
<br />
<br />
<center>
  <div style="border: 1px dotted gray; width: 400px; padding: 5px; background-color: #efefef;">
    <core:importdesign namespace="sites::apfdocupage::pres::templates::perspectives::content" template="form_captcha_example" />
  </div>
</center>
<br />
<br />
<core:importdesign namespace="modules::comments::pres::templates" template="comment" categorykey="de_070" />