<doku:title tags="Adventure PHP Framework,Andenture,PHP,Framework,Einsatz,Features,Performance,Sicherheit,Wiederverwendbarkeit,Module" title="Why APF?" urlname="Why-APF">
  Auf dieser Seite finden Sie einen Vergleich des APF zu anderen Frameworks. Es wird aufgezeigt,
  welche Features das APF herausragend gestaltet.
</doku:title>
<core:importdesign namespace="sites::apfdocupage::pres::templates::perspectives::content::voting" template="voting" />
Sie denken: &quot;Das APF ist nur ein weiteres Framework&quot;? Auf dieser Seite finden Sie
Gr&uuml;nde, warum Sie das Adventure PHP Framework (APF) unbedingt einsetzen und sollten!
<br />
<br />
Das APF unterst&uuml;tzt Sie, enterprise-ready Web-Applikationen und -Module zu entwickeln, die
schnell, sicher und wiederverwendbar sind. Das Framework bietet dabei sowohl erprobte Tools zur
Entwicklung nach anerkannten Design-Pattern als auch fertige Module, die bekannte Aufgabenstellungen
allgemeing&uuml;ltig l&ouml;sen.
<br />
<br />
<br />
<a name="Feature-Matrix"></a><h3>Feature-Matrix</h3>
Die Feature-Matrix gibt einen &Uuml;berblick &uuml;ber die vorhandenen Features und vergleicht das
Adventure PHP Framework (APF) mit anderen Produkten.
<br />
<br />
<center><img src="http://media.adventure-php-framework.org/content/why_apf_feature_comparison.png" alt="Adventure PHP Framework - Feature-Matrix" /></center>
<br />
<br />
Die in der Feature-Matrix enthaltenen Bewertungsstufen haben folgende Bedeutung:
<ul style="list-style-type: none;">
  <li>
    <img src="http://media.adventure-php-framework.org/content/feature_matrix_plus.png" alt="Adventure PHP Framework (APF)" />
    Volle Unterst&uuml;tzung
  </li>
  <li>
    <img src="http://media.adventure-php-framework.org/content/feature_matrix_question.png" alt="Adventure PHP Framework (APF)" />
    In Ans&auml;tzen enthalten
  </li>
  <li>
    <img src="http://media.adventure-php-framework.org/content/feature_matrix_minus.png" alt="Adventure PHP Framework (APF)" />
    Nicht enthalten / nicht unterst&uuml;tzt
  </li>
</ul>
<br />
<br />
<a name="Features-Ueberblick"></a><h3>Die Features im &Uuml;berblick</h3>
Die nachfolgende Liste zeigt Ihnen die Features nochmal im Detail und beschreibt diese kurz:
<br />
<br />
<h4>PHP 4</h4>
Das APF ist konzeptionell so abstrahiert, dass es weiterhin PHP in der Version 4 unterst&uuml;tzt.
Gerade im Shared-Hosting-Bereich ist PHP 4 noch h&auml;ufig im Einsatz.
<br />
<br />
<br />
<h4>PHP 5</h4>
Auf Grund der Konzeption wird PHP 5 ebenso unterst&uuml;tzt wir PHP 4. F&uuml;r PHP 5 steht ein
eigenes Release zur Verf&uuml;gung in der die notwendigen Anpassungen an die ge&auml;nderten
Sprachkonstrukte vorgenommen wurden.
<br />
<br />
<br />
<h4>HMVC / MVC 2</h4>
MVC ist im Bereich Web ein sehr weit verbreitetes Design-Pattern. MVC f&uuml;r sich genommen
bietet jedoch nur eine begrenze Anwendungsm&ouml;glichkeit. Aus diesem Grund findet im APF das
erweiterte MVC-Konzept - HMVC bzw. MVC 2 genannt - Anwendung. Dieses erm&ouml;glicht nicht nur
hirarchische Strukturen und noch flexiblere Implementierung, sondern garantiert auch einfache
Erweiterbarkeit von bestehenden Anwendungen &uuml;ber TagLibs und Document-Controller!
<br />
<br />
<br />
<h4>Page-Controller</h4>
Der Page-Controller ist die zentrale Komponente des Frameworks. Diese stellt eine
allgemeing&uuml;ltige Umgebung f&uuml;r die Entwicklung nach dem HMVC- bzw. MVC2-Pattern bereit.
Der Page-Controller &uuml;bernimmt dabei die Entgegennahme eines Requests, die Ausf&uuml;hrung
der Input-Filter, das Erzeugen des APF-DOM-Baumes, die Transformation desselben und die Ausgabe.
<br />
Durch den generischen Tag-Parser ist der Funktionsumfang des Page-Controllers sehr einfach
erweiterbar und es gibt bereits heute zahlreiche Erweiterungen, die die Effektivit&auml;t bei
der Entwicklung deutlich steigern.
<br />
<br />
<br />
<h4>Front-Controller</h4>
Der Front-Controller gibt dem Entwickler die M&ouml;glichkeit, vor dem Erzeugen der
Page-Controller-Seite Actions auszuf&uuml;hren. Diese k&ouml;nnen dazu genutzt werden um die
Business-Schicht einer Applikation zu erzeugen und das Model dieser zu initialisieren. So ist
es m&ouml;glich, die Gestaltung der Pr&auml;sentationsschicht durch die Businessschicht zu
beeinflussen.
<br />
In Zusammenarbeit mit dem Page-Controller ist es mit dem APF m&ouml;glich Module lose zu koppeln
und damit f&uuml;r den Einsatz in unterschiedlichen Webseiten oder Applikationen zu implementieren.
<br />
&Uuml;ber das Front-Controller-Timing-Model ist es m&ouml;glich Actions f&uuml;r die
unterschiedlichsten Aufgaben einzusetzen.
<br />
<br />
<br />
<h4>TagLibs</h4>
Durch die generische Implementierung des Page-Controllers ist es m&ouml;glich beliebige TagLibs
zu definieren, wie sie aus dem JAVA-Bereich bekannt sind. Die Funktionalit&auml;t ist dabei durch
Klassen bestimmt, die einem definierten Interface gen&uuml;gen.
<br />
Der Entwickler kann dabei beliebige eigene TagLibs einbinden und so die Funktion des Frameworks
erweitern oder die Anforderungen einer Anwendung umsetzen. Durch den Aufbau des APF-DOM-Baumes
f&uuml;gt sich jeder Tag als Kind-Objekt desjenigen Templates ein, in dem es definiert wurde. Da
jedes Kind eine Beziehung zum Vater-Objekt besitzt ist es innerhalb einer TagLib m&ouml;glich auf
den kompletten DOM-Baum zuzugreifen und diesen zu manipulieren. Dies wird beispielsweise bei den
Formular-TagLibs verwendet um Validierungsinformationen eines Formularelements an das Formular
weiterzugeben.
<br />
<br />
<br />
<h4>Erweiterte Konfiguration</h4>
Das Framework kennt drei Unterscheidungsm&ouml;glichkeiten f&uuml;r die Adressierung von
Konfigurationsdateien: Namespace, Context und Umgebung. Durch diese Parameter ist es nicht nur
m&ouml;glich Module f&uuml;r unterschiedliche Applikationen zu entwickeln, sondern auch f&uuml;r
verschiedene Umgebungen (Stage, Live, ...).
<br />
<br />
<br />
<h4>Tag-basierte Formulare</h4>
Durch die Tag-basierte Definition von Formularen hat der Template-Bauer oder Entwickler die maximale
Flexibilit&auml;t hinsichtlich der Gestaltung von Formularen. Aufw&auml;ndige Definitionen von
Formularen in Controller-Dateien und unflexible Gestaltung von Formularen &uuml;ber PHP-Code entfallen
g&auml;nzlich. Durch das <em>&lt;form:addtaglib /&gt;</em>-Tag ist es einfach, die bestehende
Formular-Funktion mit eigenen Taglibs zu erweitern.
<br />
<br />
<br />
<h4>Integriertes Benchmarking</h4>
Das Thema Benchmarking ist im Adventure PHP Framework durch die zentrale Komponente generisch
abgebildet. Es werden auch ohne weitere Messpunkte die wichtigsten Punkte gemessen um bereits
w&auml;hrend der Entwicklung Performance-orientiert Software-Entwicklung betreiben zu k&ouml;nnen.
<br />
<br />
<br />
<h4>Erweitertes URL-Handling</h4>
Die Gestaltung der Input-Filter erm&ouml;glichen den Betrieb einer Applikation bzw. Webseite im
normalen URL-Layout und mit Rewrite-URLs. Es stehen f&uuml;r beide Betriebsarten entsprechende Filter
und Tools zur Generierung und Manipulation von URLs zur Verf&uuml;gung.
<br />
<br />
<br />
<h4>Zus&auml;tzliche Produktivit&auml;tstools</h4>


core:appendnode, Iterator, Mediastream-Tag, ...

<br />
<br />
<br />
<h4>Entwicklungsumgebung (Sandbox)</h4>


<br />
<br />
<br />
<h4>Zus&auml;tzliche Module</h4>

- BBCodeParser!!
- CAPTCHA-TagLib.

<br />
<br />
<br />
<h4>OR-Mapper</h4>


<br />
<br />
<br />
<h4>Datenbank-Abstraktion</h4>


<br />
<br />
<br />
<h4>Caching</h4>


<br />
<br />
<br />
<h4>Validierung</h4>


<br />
<br />
<br />
<h4>Filtering</h4>


<br />
<br />
<br />
<h4>Internationalisierung</h4>


<br />
<br />
<br />
<h4>Session-Tools</h4>


<br />
<br />
<br />
<h4>Singleton / Session-Singleton</h4>


<br />
<br />
<br />
<h4>Logging</h4>


<br />
<br />
<br />
<h4>Advanced Templating</h4>
<br />
Die Struktur und Komplexit&auml;t des DOM-Baumes wird dabei durch den Entwickler definiert.
Jeder Knoten entspricht dabei ein HMVC-Knoten, dessen Ausgabe &uuml;ber einen Controller oder
&uuml;ber die Funktionalit&auml;t von TagLibs beeinflusst werden kann. So muss die MVC-Struktur
nicht bei jeder Applikation/jedem Modul neu implementiert werden.
<br />
<br />

<br />
Dar&uuml;ber hinaus beinhaltet die Dokumentationswebseite zahlreiche Beispiele und Artikel zu
allt&auml;glichen Problemstellungen und Tutorials nicht nur die Umsetzung eines gegebenen Problems
mit dem Framework aufzeigen, sondern auch auf das Software-Design eingehen.
<br />
<br />
<br />
<core:importdesign namespace="modules::comments::pres::templates" template="comment" categorykey="de_075" />