<font style="font-size: 26px; font weight: bold;">Roadmap</font>
<br />
<br />
Im Folgenden wird die Roadmap der Entwicklung und der Dokumentation des Adventure-PHP-Frameworks
aufgezeigt. Die Roadmap basiert auf der aktuellen Planung des Entwickler-Teams, kann jedoch durch
Kunden-Anforderungen beeinflusst werden. Nutzen Sie hierzu bitte das
<a href="http://forum.adventure-php-framework/de/" title="Forum" target="_blank">Forum</a>. Der
Release-Plan gestaltet sich f&uuml;r die zuk&uuml;nftigen Versionen wie folgt:
<br />
<br />
<br />

<div style="width: 100%; background-color: #777BB4; color: white; padding: 3px;">
  &nbsp;<font style="font-size: 20px; font-wight: bold;">Release 2.0</font> (Ende 2008)
</div>
<br />
<strong>Wichtige Features:</strong>
<ul style="margin-top: 3px;">
  <li>Unterst&uuml;tzung f&uuml;r PHP 4 entfernen</li>
  <li>Redesign der Core-KOmponenten auf "PHP 5 only"</li>
  <li>Workflow-Controller zur einfacheren Erstellung von Wizzards einf&uuml;hren</li>
</ul>

<br />
<div style="width: 100%; background-color: #777BB4; color: white; padding: 3px;">
  &nbsp;<font style="font-size: 20px; font-wight: bold;">Release 1.7</font> (QII/QIII 2008)
</div>
<br />
<strong>Wichtige Features:</strong>
<ul style="margin-top: 3px;">
  <li>Redesign der Dokumentationsseite</li>
  <li>
    Einf&uuml;hren der Registry und Ersetzen des ApplicationManagers f&uuml;r konfigurationsloses
    einsetzen des Frameworks.
  </li>
  <li>
    Einf&uuml;hrung einer OR-Mapper-Komponente, die nicht nur Objekte in einer relationalen Datenbank
    abbilden kann (Table-Data-Gateway, Row-Data-Gateway), sondern komplette Objektb&auml;ume
    laden und Persistieren kann (Generic-Data-Mapper).
  </li>
  <li>
    Auslieferung eines Usermanagement-Moduls, das generisch f&uuml;r verschiedene Applikationen
    eingesetzt werden kann. Das Modul basiert auf dem generischen OR-Mapper.
  </li>
  <li>Weitere Tutorials (<em>Behind the site</em>) und &Uuml;bersetzung der restlichen Dokumentation.</li>
  <li>Auslieferung von getrennten Releases f&uuml;r PHP4 und PHP5.</li>
  <li>Bugfixing & allgemeine Verbesserungen</li>
</ul>

<br />
<div style="width: 100%; background-color: #777BB4; color: white; padding: 3px;">
  &nbsp;<font style="font-size: 20px; font-wight: bold;">Release 1.6</font> (15.06.2008)
</div>
<br />
<strong>Wichtige Features:</strong>
<ul style="margin-top: 3px;">
  <li>&Uuml;bersetzung der restlichen Tutorials</li>
  <li>Erweiterung der Tutorials und Einsteiger-Materialien (FrontController!)</li>
  <li>Tutorial f&uuml;r Frontcontroller-basiertes Login-Formular bzw. Bild-Ausgabe via Action</li>
  <li>Singleton-Klasse um SessionSingleton-Klasse erweitern</li>
  <li>Einf&uuml;hung connectionManager zur Abstraktion von DB-Treibern</li>
  <li>Einf&uuml;hrung eines SQLite DB-Treibers</li>
  <li>Bugfixing & allgemeine Verbesserungen</li>

  <!-- noch zu klären //-->
  <li>Artikel &uuml;ber Coding Conventions im Framework und Vorschl&auml;ge von Richtlinen</li>
  <li>XML-Sitemap generieren und mit dem Release ausliefern (SEO)</li>
  <li>CAPTCHA-Formular-Control</li>
  <li>Spam-Schutz f&uuml;r G&auml;stebuch inkl. Tutorial und Dokumentation</li>
  <li>Kalender-Modul optimieren, dokumentieren und ausliefern</li>
</ul>

<br />
<div style="width: 100%; background-color: #777BB4; color: white; padding: 3px;">
  &nbsp;<font style="font-size: 20px; font-wight: bold;">Release 1.5</font> (15.01.2008)
</div>
<br />
Das Release 1.5 ist ein Dokumentations-Release. Der urspr&uuml;ngliche Termin (QIV 2007) wurde
verschoben, da die &Uuml;bersetzung der Dokumentation im Vordergrund stand. Updates an der
Dokumentation werden laufend eingearbeitet (siehe Feature-Liste), Feature-Updates werden wie gewohnt
in einer Beta-Version verf&uuml;gbar sein.
<br />
<br />
<strong>Wichtige Features:</strong>
<ul style="margin-top: 3px;">
  <li>&Uuml;bersetzung der Dokumentation (erledigt)</li>
  <li>&Uuml;bersetzung der Tutorials</li>
  <li>Installation eines deutschen und englischen Forums (erledigt)</li>
  <li>Dokumentation Calendar-Komponente</li>
  <li>Klassen-Referenz ausbauen (erledigt)</li>
  <li>Ausgabe und evtl. Framework auf UTF-8 umstellen (wurde bereits in einem Projekt umgesetzt)</li>
  <li>Erweiterung bestehender Applikationen auf Mehrsprachigkeit (erledigt)</li>
  <li>Tool erstellen, mit dem man abhängig von einer FrontController-Action Links generieren kann (erledigt)</li>
  <li>Spam-Schutz f&uuml;r Kommentarfunktion (erledigt)</li>
  <li>Bugfixing & allgemeine Verbesserungen</li>
</ul>

<br />
<div style="width: 100%; background-color: #777BB4; color: white; padding: 3px;">
  &nbsp;<font style="font-size: 20px; font-wight: bold;">Release 1.4</font> (25.10.2007)
</div>
<br />
Das Release 1.4 soll in mehreren Beta-Versionen vorab testbar sein. Gr&ouml;&szlig;te &Auml;nderung
wird die Kompatibilit&auml;ts-Version f&uuml;r PHP 5 sein. Die Beta-Versionen werden regelm&auml;&szlig;ig
auf der Startseite und in den News angek&uuml;ndigt.
<br />
<br />
<strong>Wichtige Features:</strong>
<ul style="margin-top: 3px;">
  <li>PHP 5 Umstellung + Kompatibilit&auml;t zu 4 sicherstellen</li>
  <li>Einsteiger-Tutorial basierend auf "Hallo Welt!":
    <ul>
      <li>Wie baue ich mit dem Framework meine erste Webseite.</li>
      <li>Wie erstelle ich dynamische Inhalte in der neuen Webseite</li>
      <li>Wie lade ich Inhalte aus der Datenbank nach</li>
    </ul>
  </li>
  <li>mailSender soll um setBCCRecipient() und addHeader() erweitert werden.</li>
  <li>Erweiterung FAQs</li>
  <li>Installations-Tutorial f&uuml;r Benutzer auf Basis des Framework-Codes</li>
  <li>Modul f&uuml;r Social-Bookmarking implementieren und per Tag einbauen (inkl. Tutorial)</li>
  <li>
    Erweiterung Formular-Validatoren: Es soll m&ouml;glich sein einen beliebigen Text in den Validator
    zu schreiben, der dann ausgegeben wird. Dies soll innerhalb einer ValGroup und auch innerhalb
    eines Formulars m&ouml;glich sein. Beispiel:<br />
    <em>&lt;form:genericval field="" button="" type=""&gt;Text/Inhalt, der ausgegeben werden soll&lt;/form:genericval&gt;</em>
  </li>
  <li>Roadmap des Frameworks und der Dokumentation aufzeigen</li>
  <li>Bugfixing & allgemeine Verbesserungen</li>
</ul>