<core:addtaglib namespace="sites::apf::pres::taglib" prefix="news" class="item" />
<news:item>
   <img src="http://media.adventure-php-framework.org/img/illustrations/thumbs/package-1.12.png" alt="Version 1.12 (beta) released!" />
   <h3><int:link pageid="15">Version 1.12 (beta) released!</int:link></h3>
   <div class="date">Montag, 12. April 2010</div>
   <p>
      Das APF-Team freut sich, die erste Vorschau-Version des Release 1.12 ank&uuml;ndigen zu k&ouml;nnen.
   </p>
   <p>
      Die Version dient der Vorschau der auf der
      <a class="wiki" href="http://wiki.adventure-php-framework.org/de/Roadmap" title="Roadmap">Roadmap</a>
      beschrieben Features. Zum vollst&auml;ndigen Release fehlt nur noch eine Erweiterung des GORM.
   </p>
   <p>
      Die wesentlichen &Auml;nderungen in diesem Release sind:
   </p>
   <ul>
      <li>Refactoring der API</li>
      <li>Neue Extension (HTMLList, bald auch Client-Validatoren)</li>
      <li>Spezielle Validatoren und neue Fehler-Markierung in den Formular-Taglibs</li>
      <li>Einf&uuml;hrung von Exceptions statt <em>trigger_error()</em></li>
      <li>MySQLi-Datenbank-Treiber</li>
   </ul>
   <p>
      Das Team freut sich auf Feedback!
   </p>
</news:item>

<news:item>
   <img src="http://media.adventure-php-framework.org/img/illustrations/thumbs/package-1.11.png" alt="Version 1.11 (stable) released!" />
   <h3><int:link pageid="008">Version 1.11 (stable) released!</int:link></h3>
   <div class="date">Sonntag, 31. Januar 2010</div>
   <p>
      Das APF-Team freut sich, zusammen mit der neuen Webseite das APF in der stabilen Version 1.11
      ank&uuml;ndigen zu k&ouml;nnen.
   </p>
   <p>
      Die neue Version wartet mit einer &Uuml;berarbeitung der <int:link pageid="113">Formular-Unterst&uuml;tzung</int:link>
      auf Basis von Taglibs auf. Diese beherrscht nun die generische Definition von Validatoren und 
      Filtern auf Basis des Observer-Patterns und ist deutlich einfacher an die eigenen Bed&uuml;rfnisse
      anzupassen.
   </p>
   <p>
      Der bereits im Release 1.9 erschienene OR-Mapper <int:link pageid="063">GenericORMapper</int:link>
      wurde in dieser Ausgabe um Tools zum <int:link pageid="063" anchor="Chapter-3-Datenbank-Setup">automatischen Setup</int:link>
      und <int:link pageid="128">Update einer Datenbank</int:link> erweitert. Der Entwickler kann
      sich nun komplett auf die Entwicklung der Logik der Anwendung k&uuml;mmern, die Speicherung der
      Objekte wird vom Mapper &uuml;bernommen.
   </p>
   <p>
      Inhalt der Performance-Optimierungen des Releases waren Optimierungen im Kern des Frameworks und die
      &Uuml;berarbeitung des integrierten <int:link pageid="004">BenchmarkTimer</int:link>s. Dieser
      unterst&uuml;tzt den Entwickler nun durch eine besser grafische Aufbereitung der Messungen noch
      besser in der Analyse der Hot Spots in einer Anwendung. Er erm&ouml;glicht nun, die Applikationen
      optimal auf den Einsatz im Live-Betrieb vorzubereiten.
   </p>
   <p>
      Mit Erscheinen des Releases 1.11 wurde die Unterst&uuml;tzung f&uuml;r PHP 4 abgek&uuml;ndigt 
      und die Kompatibilit&auml;t mit PHP 5.3 nochmals verbessert. In der kommenden Version 1.12 liegt
      der Fokus auf der Erweiterung der neuen Formular-Unterst&uuml;tzung und der &Uuml;berarbeitung
      der Konfigurations-Komponente.
   </p>
</news:item>

<news:item>
   <img src="http://media.adventure-php-framework.org/img/illustrations/security-goblet.png" alt="APF security award" />
   <h3><int:link pageid="108" /></h3>
   <div class="date">Sonntag, 17. Januar 2010</div>
   <p>
      <strong>Das APF-Security-Versprechen:</strong>
      Nutzen Sie das APF und profitieren Sie automatisch von dessen Sicherheitsmechanismen! Von Grund
      auf sichere Anwendungen verhindern die Kompromittierung Ihres Systems, gew&auml;hrleisten somit
      die Sicherheit der Nutzer und Ihres Renommees und lassen Sie beruhigt schlafen.
   </p>
   <p>
      Der Artikel <int:link pageid="108" /> soll Ihnen zeigen, welche M&ouml;glichkeiten das APF
      bietet, um dieser Gefahr offensiv zu begegnen und die eigene Anwendung absichern zu k&ouml;nnen.
      (<int:link pageid="108">mehr lesen&hellip;</int:link>)
   </p>
</news:item>

<news:item>
   <img src="http://media.adventure-php-framework.org/content/first-steps.png" alt="Download, Installation und erste Schritte von Ralf Schubert" />
   <h3><int:link pageid="111" /></h3>
   <div class="date">Sonntag, 04. Oktober 2009</div>
   <p>
      <strong>Ralf Schubert</strong> ist begeisterter APF-Entwickler. Um Neueinsteiger bei
      der Verwendung des APF zu unterst&uuml;tzen hat er ein Tutorial verfasst. Darin werden die ersten
      Schritte mit dem Framework zu erkl&auml;ren.
   </p>
   <p>
      Das Tutorial <int:link pageid="111" /> beschreibt Schritt f&uuml;r Schritt die Einrichtung des
      Adventure PHP Framework vom Download bis zur &quot;Hallo Welt&quot; Applikation.
      (<int:link pageid="111">mehr lesen&hellip;</int:link>)
   </p>
</news:item>

<news:item>
   <img src="http://media.adventure-php-framework.org/img/illustrations/thumbs/package-1.10.png" alt="Adventure PHP Framework - Release 1.10 (stable): Refactoring, Performance-Optimierung, full PHP5-Support" />
   <h3>Version 1.10 (stable) ver&ouml;ffentlicht!</h3>
   <div class="date">Sonntag, 04. September 2009</div>
   <p>
      Das APF-Team hat heute das Release 1.10 (stable) angek&uuml;ndigt. Mit diesem
      Maintenance-Release wurde die Entwicklung komplett auf PHP5 umgestellt, f&uuml;r PHP4 ist bis
      Anfang 2010 eine Kompatibilit&auml;ts-Version erh&auml;ltlich. Neben einigen Aufr&auml;umarbeiten
      sorgen Performance-Optimierungen f&uuml;r eine gleich bleibend exzellente Performance. Die
      gr&ouml;&szlig;te technische Neuerung ist die Einf&uuml;hrung eines "dependency injection
      container", &auml;hnlich der Objekt-Initialisierung von SPRING (JAVA). Auch in diesem Release
      finden sich zahlreiche Features im Framework wieder, die im Entwickler-Forum als Wunsch
      diskutiert wurden. Dar&uuml;ber hinaus sind in der finalen Version des 1.10-er Zweiges alle
      &Auml;nderungen aus dem Feedback zu den Release Candidates enthalten.
   </p>
</news:item>

<news:item>
   <img src="http://media.adventure-php-framework.org/img/illustrations/guestbook.png" alt="Objektorientiertes Design eines G&auml;stebuchs" />
   <h3><int:link pageid="112" /></h3>
   <div class="date">Donnerstag, 03. September 2009</div>
   <p>
      G&auml;stebuch? Sicher denken Sie nun, dass ein G&auml;stebuch nun wirklich kein geeignetes
      Beispiel f&uuml;r einen Artikel &uuml;ber objektorientiertes Design ist? Im Gegenteil! In einem
      G&auml;stebuch steckt eine Vielzahl von Elementen, die auch in anderen Web-Anwendungen
      ben&ouml;tigt werden. Und: der objektorientierte Entwurf bringt eine gute Portion Spannung in das
      verstaubte Thema.
   </p>
   <p>
      Der Artikel <int:link pageid="112" /> beleuchtet das Thema aus der Perspektive gro&szlig;er
      Software-Anwendungen und zeigt auf, wie ein Technologie-unabh&auml;ngiges Design erstellt
      werden kann, das sp&auml;ter als Basis f&auml;r die Umsetzung dient. Dabei wird auf die
      ben&ouml;tigten Techniken wie UML und ER-Diagramm sowie auf die Grundlagen des Software-Designs
      eingegangen.
      (<int:link pageid="112">mehr lesen&hellip;</int:link>)
   </p>
</news:item>

<news:item>
   <img src="http://media.adventure-php-framework.org/img/illustrations/red_hat_logo.png" alt="RPM-Installations-Pakete f&uuml;r das APF von Reiner Rottmann" />
   <h3><int:link pageid="110" /></h3>
   <div class="date">Sonntag, 26. September 2009</div>
   <p>
      Ab heute stehen RPM-Pakete zur Installation und Verteilung des APF auf RedHat-basierten
      LINUX-Distributionen zur Verf&uuml;gung. Reiner Rottmann hat dazu einen dedizierten YUM-Channel
      bereit gestellt, der Code- sowie Demo-Pakete beinhaltet.
   </p>
   <p>
      Das <int:link pageid="110" /> beschreibt, wie die Pakete mit Hilfe des <em>Yellowdog Update
      Managers</em> (YUM) verwaltet werden k&ouml;nnen.
   </p>
   <p class="legal">
      Rechtlicher Hinweis: das abgebildete Logo ist Eigentum von
      <a href="http://www.redhat.com/" title="RedHat">RedHat</a> und unterliegt den auf der
      Hersteller-Seite beschriebenen rechtlichen Bestimmungen.
   </p>
</news:item>

<news:item>
  <img src="http://media.adventure-php-framework.org/content/apf-vs-yii.png" alt="Performance-Check: Yii vs. APF (and CakePHP)" />
  <h3><int:link pageid="103">Performance-Check: Yii vs. APF (und CakePHP)</int:link></h3>
  <div class="date">Sonntag, 01. M&auml;rz 2009</div>
  <p>
     Der Artikel Yii vs. APF empfindet den RPS-Performance-Test aus
     <a class="external" href="http://www.yiiframework.com/performance">http://www.yiiframework.com/performance</a>
     nach und vergleicht die Test-Kandidaten CakePHP, Yii-Framework und Adventure PHP Framework.
     Ergebnis: <strong>der Yii-Test ist bestanden!</strong>
     (<int:link pageid="103">mehr lesen&hellip;</int:link>)
   </p>
</news:item>

<news:item>
   <img src="http://media.adventure-php-framework.org/content/why_apf_teaser.png" alt="Why APF?" />
   <h3><int:link pageid="088" /></h3>
   <p>
      Sie denken: &quot;Das APF ist nur ein weiteres Framework&quot;? Auf der Seite
      <int:link pageid="088" /> finden Sie Gr&uuml;nde, warum Sie das Adventure PHP Framework (APF)
      unbedingt einsetzen und sollten!
   </p>
   <p>
      <strong>Kurz zusammengefasst:</strong> Das APF unterst&uuml;tzt Sie, enterprise-ready
      Web-Applikationen und -Module zu entwickeln, die schnell, sicher und wiederverwendbar sind.
      Das Framework bietet dabei sowohl erprobte Tools zur Entwicklung nach anerkannten Design-Pattern
      als auch fertige Module, die bekannte Aufgabenstellungen allgemeing&uuml;ltig l&ouml;sen.
   </p>
</news:item>

<news:item>
   <h3>Neues Einsteiger-Tutorial "Minimales Modul"</h3>
   <p>
      Wie im Forum gew&uuml;nscht wurde ein neues, forenbasiertes Einsteiger-Tutorial verfasst, das
      zeigt, wie ein einfaches Modul f&uuml;r das Adventure PHP Framework erstellt werden kann. Es
      beschreibt Schritt f&uuml;r Schritt wie aus einem leeren Template ein Taschenrechner
      entsteht. Das Tutorial kann unter
      <a class="forum" href="http://forum.adventure-php-framework.org/de/viewtopic.php?f=6&t=44" linkrewrite="false" title="Minimales Modul">http://forum.adventure-php-fra...ic.php?f=6&t=44</a>
      aufgerufen werden.
   </p>
</news:item>

<news:item>
   <h3>Erste Schritte mit dem Adventure PHP Framework!</h3>
   <p>
      Das Tutorial <int:link pageid="048" /> in der Rubrik <int:link pageid="071" /> zeigt, wie der
      Entwickler auf sehr einfache Seite eine Webseite mit dem Framework erstellen kann. Es wird
      zus&auml;tzlich ein Ausblick auf komplexere Webseiten und die M&ouml;glichkeit dynamischen
      Inhalt anzuzeigen gegeben. Wichtige Informationen sind auch im Forums-Thread
      <doku:link>http://forum.adventure-php-framework.org/de/viewtopic.php?f=6&t=17</doku:link>
      enthalten.
   </p>
</news:item>

<news:item>
   <h3>Hacking & das Adventure PHP Framework?</h3>
   <p>
      Im Artikel <a href="./?Seite=060-HaCkinG-und-das-APF" title="Hacking & das Adventure PHP Framework">Hacking & das Adventure PHP Framework</a>
      unter der Rubrik <strong>Literatur</strong> zieht Christian Achatz ein Res&uuml;mee aus dem Betrieb der
      letzten 3 Monate und zeigt auf, welche Sicherheitsfeatures das Framework f&uuml;r den Betrieb
      einer Webseite oder einer Webapplikation bereits out-of-the-box mitbringt. Gerade in einer Zeit, in
      der Exploits tausendfach verf&uuml;gbar sind, gilt es ein wirksames Mittel bereit zu halten, das
      <em>Script-Kiddies</em> keine Chance gibt.
   </p>
</news:item>

<news:item>
   <h3>AJAX und das Adventure PHP Framework!</h3>
   <p>
      Der Artikel
      <a href="./?Page=061-AJAX-and-the-APF" title="AJAX & the APF">AJAX & the adventure php framework</a>
      (englisch) zeigt, wie AJAX-Anwendungen in die Software-Architekturen bestehender Module
      eingef&uuml;gt werden k&ouml;nnen, wie das Adventure PHP Framework dabei hilft und welche Probleme
      bei der Implementierung auftreten k&ouml;nnen. Ein Review mit hilfreichen Hinweisen und offenen
      Fragestellungen schlie&szlig;en den Artikel und laden zur Kommentierung ein.
   </p>
</news:item>

<news:item>
   <h3>Adventure PHP Framework Anwenderprojekte!</h3>
   <p>
      Auf der Seite <a href="./?Seite=041-Referenzen" title="Referenzen">Referenzen</a> sind Projekte von
      Anwendern aufgef&uuml;hrt. <strong>Wir w&uuml;rden uns freuen, wenn auch Sie Ihr Projekt melden
      und einen kurzen Erfahrungsbericht abgeben. Nur so kann die Qualit&auml;t der Dokumentation und
      des Frameworks selbst verbessert und vereinfacht werden.</strong>
   </p>
</news:item>

<news:item>
   <h3>Was leistet das Adventure PHP Framework?</h3>
   <div class="date">25.10.2007</div>
   <p>
      Ab heute steht der Artikel <a href="./?Seite=049-PHP-Frameworks-im-Test" title="PHP Frameworks im Test">PHP Frameworks im Test</a>
      zur Verf&uuml;gung. Dieser vergleicht die am Markt verf&uuml;gbaren Parallelprodukte und gibt dem
      Leser eine &Uuml;bersicht der Leistungsmerkmalen im Hinblick auf die Entscheidung f&uuml;r ein
      Produkt als langfristige Entwicklungsbasis. Der Artikel kann jedoch nicht nur als Vergleichswerk
      sondern vielmehr auch als Ressource f&uuml;r die Verwendung einzelner Testkandidaten herangezogen
      werden.
   </p>
</news:item>